import matplotlib.pyplot as plt
import numpy as np

# --- Часть 1: Получение исходной таблицы данных ---

x = np.zeros(11)
y = np.zeros(11)
float_rn = np.zeros(11)

# Заполнение вектора x от 0 до 10 с шагом 1
for i in range(0, 10):
    x[i+1] = x[i] + 1

# Заполнение вектора случайных чисел и вычисление y
for i in range(0, 11):
    float_rn[i] = np.random.rand()
    y[i] = 0.5 * np.sin(x[i]) + 2 * float_rn[i]

print("Вектор значений x: \n", x)
print("Вектор сл.значений от 0 до 1: \n", float_rn)
print("Вектор значений y(x): \n", y)

# --- Часть 2: Построение графика ---

# Построение графика
plt.title("Зависимость y(x) = 0.5*sin(x)+2*rand") # заголовок
plt.xlabel("x") # ось абсцисс
plt.ylabel("y") # ось ординат
plt.grid()      # включение отображение сетки
plt.plot(x, y, "r*")  # построение графика (красные звездочки)
plt.show()


'''
OUTPUT:

Вектор значений x:  [ 0.  1.  2.  3.  4.  5.  6.  7.  8.  9. 10.]
Вектор сл.значений от 0 до 1: [0.46449122 0.30669835 0.18620595 0.13223051 0.17332797 0.37172477 0.54480501 0.70161823 0.35709033 0.64016975 0.73477446]
Вектор значений y(x): [ 0.92898244  1.0341322   0.82706062  0.33502103 -0.03174531  0.26398739   0.94990228  1.73172976  1.20885978  1.48639874  1.19753837]
'''
